{
  "name": "Завод пургена",
  "icon": "jigsaw_pp:purgen_factory",
  "category": "jigsaw_pp:purgen_category",
  "pages": [
    {
      "type": "patchouli:multiblock",
      "name": "Завод пургена",
      "multiblock": {
        "mapping": {
          "F": "jigsaw_pp:purgen_factory[facing=east]",
          "H": "jigsaw_pp:factory_heater[facing=east,is_furnaced=1]",
          "0": "minecraft:furnace[facing=east]"
        },
        "pattern": [
          ["F"],
          ["H"],
          ["0"]
        ]
      }
    },
    {
      "type": "patchouli:spotlight",
      "title": "Индукционная плита",
      "item": "jigsaw_pp:factory_heater",
      "text": "Пурген завод состоит из нескольких частей:$(br)Индукционный нагреватель. Превращает тепло из источников типа печик в электричество. Потом при помощи индукции греет пургеновый завод.$(br)См. след. стр..."
    },
    {
      "type": "patchouli:spotlight",
      "title": "Завод пургена",
      "item": "jigsaw_pp:purgen_factory",
      "text": "Сам завод. Может готовить пурген, когда нагрет, и все ингредиенты на месте. Имеет слоты:$(br)$(li)2 слота для рецептурных ингредиентов. Здесь должны быть предметы указанные в рецепте.$(li)2 слота под любую еду. Лучше еда - лучше продукт. Но не стоит класть одинаковую еду.$(br)$(li)Верхний правый слот с алмазом - катализатор. См. отдельную статью.$(li)Ниже слот под пустые пилюли.$(li)Коричневый слот - вывод продукции.$(li)Слот под карту увеличения, см. отдельную статью."
    },
    {
      "type": "patchouli:spotlight",
      "title": "Готовим правильно",
      "item": "jigsaw_pp:basic_purgen_pilule",
      "text": "Ну и конечно там бак для жидкости. Можете наполнить правым кликом с ведром жидкости, как в рецепте.$(br)Как говорилось выше - процесс записан в рецептах. См. в JEI. Рецепт состоит из двух ингредиентов и жидкости. Остальное на ваш выбор, что делает пурген уникальным.$(br)Завод производит пилюли, основываясь на параметрах из рецепта. А именно средняя чистота, прибавочное время, побочки и шанс неполадки."
    },
    {
      "type": "patchouli:spotlight",
      "title": "Неполадка",
      "item": "minecraft:tnt",
      "text":  "В процессе может случиться сбой. Шанс неполадки установлен в рецепте (предмет ТНТ в меню), а также может быть изменен катализаторами.Это почти никогда не взрыв. Обычно сбой дерьмовый.$(br)$(bold)ПРо автоматизацию.$(reset) В ванилле завод автоматизировать нельзя. Но мы играем с модами.$(br)Жидкость можно налить через трубы. Ингредиенты всовывать с боков, даже воронками. Пустые пилюли и катализаторы сверху. Самое важное - вывод. Так как низ заблокирован - достать пилюли можно сбоку (например воронками из 'create')."
    }
  ]
}